{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-AGE",
    "1": "B-BREED",
    "2": "B-COLOR",
    "3": "B-FURLENGTH",
    "4": "B-GENDER",
    "5": "B-PET_TYPE",
    "6": "B-SIZE",
    "7": "B-STATE",
    "8": "I-AGE",
    "9": "I-BREED",
    "10": "I-COLOR",
    "11": "I-FURLENGTH",
    "12": "I-GENDER",
    "13": "I-PET_TYPE",
    "14": "I-SIZE",
    "15": "I-STATE",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AGE": 0,
    "B-BREED": 1,
    "B-COLOR": 2,
    "B-FURLENGTH": 3,
    "B-GENDER": 4,
    "B-PET_TYPE": 5,
    "B-SIZE": 6,
    "B-STATE": 7,
    "I-AGE": 8,
    "I-BREED": 9,
    "I-COLOR": 10,
    "I-FURLENGTH": 11,
    "I-GENDER": 12,
    "I-PET_TYPE": 13,
    "I-SIZE": 14,
    "I-STATE": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
